Revit 2024 API
ComboBoxMember Methods
The ComboBoxMember type exposes the following members.
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from RibbonItem.)
GetContextualHelp
Gets the contextual help bound with this control.
 (Inherited from RibbonItem.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetContextualHelp
Sets the contextual help bound with this button.
 (Inherited from RibbonItem.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ComboBoxMember Class
Autodesk.Revit.UI Namespace